content/index.org
# -*- coding: utf-8; -*-
#+TITLE: Hello.
#+SETUPFILE: my-org-html-theme.setup
#+STARTUP: fninline

# #+OPTIONS: H:4
#+OPTIONS: num:nil
#+OPTIONS: toc:nil
#+HTML_HEAD: <style type="text/css"> body { margin: auto; font-family: monospace; } h1.title { text-align: left; } pre.src.src-text { margin: 0px; padding: 0.5em; } </style>

* projects/
:PROPERTIES:
:ID:       ae62b1d2-7ea6-4c58-8bd6-adb3e38e72a5
:CUSTOM_ID: projects
:END:
- Eudyptula-Challenge/
  - README.txt
    #+begin_src text
      > A series of challenges relating to Linux kernel development
    #+end_src
  - [[https://github.com/scottjcrouch/eudyptula-challenge][src]]/
  - [[file:eudyptula.org::#7b320482-5d72-4c5c-9ec0-beff19101cc0][introduction]]/
  - [[file:eudyptula.org::#c2b28cc5-a489-41c1-a830-8434bc1a63ac][hello-world-module]]/
  - [[file:eudyptula.org::#80b1401c-ac7d-41a0-af2a-4d29c6183058][creating-a-custom-kernel]]/
  - [[file:eudyptula.org::#89ff7eea-432e-4ee0-a17c-516b11107734][decorating-the-version-string]]/
  - [[file:eudyptula.org::#ac689271-0c7e-4816-b5ce-b81777b0b02d][kernel-coding-style-linting]]/
  - [[file:eudyptula.org::#c5e3bcd6-dd71-4efd-8f51-eb62ba994307][udev-and-module-aliases]]/
  - [[file:eudyptula.org::#1158c320-30bc-48d3-a42c-feea3eeb6e71][the-misc-driver-interface]]/
  - [[file:eudyptula.org::#8401a002-06f1-444a-bed4-9cbe35161e52][linux-next]]/
  - [[file:eudyptula.org::#314f2c84-9822-4972-ba28-2d42d2953299][debugfs]]/
  - [[file:eudyptula.org::#29787ffa-a04c-44ac-a030-7b1452bf710c][sysfs-and-kobjects]]/
  - [[file:eudyptula.org::#4cf49816-7559-408c-bea0-5f39131bba5d][submitting-a-patch]]/
  - [[file:eudyptula.org::#253a35cd-3887-4b5c-a67b-b0dbdbed3cb0][adding-attributes-to-an-existing-kobject]]/
  - [[file:eudyptula.org::#3155bc29-4d2c-4b83-958b-c29008e1beee][intrusive-linked-lists]]/
  - [[file:eudyptula.org::#32fe9de9-7258-47db-9439-b8742c4e842e][the-slab-layer]]/
  - [[file:eudyptula.org::#e6179887-4177-4b70-8dcd-389de0dd6c74][procfs-and-task-structs]]/
  - [[file:eudyptula.org::#7b9b2b15-ca21-4f76-964b-93edc2d98ba0][creating-a-new-syscall]]/
  - [[file:eudyptula.org::#fde2b5a7-5542-42b5-a1f0-1bad9b560563][semantic-checking-and-kbuild-issues]]/
  - [[file:eudyptula.org::#51ac94e1-515d-4e7f-a7ee-7a186091f63d][kthreads-and-wait-queues]]/
  - [[file:eudyptula.org::#258b4714-e7ff-42bb-97e8-bc5b211bf260][kthreads-and-wait-queues-part-two]]/
  - [[file:eudyptula.org::#43f17fcc-501c-419c-b172-ef769dee9d39][netfilter-hooks]]/
  - [[file:eudyptula.org::#7271318d-2789-4669-9d55-e1da2d06f5ac][patching-fatfs]]/
  - [[file:eudyptula.org::#efb0188f-a193-403d-8b47-1bd0f761600f][appendices]]/
    - [[file:eudyptula.org::#db5b3b96-8ee6-4f86-8208-6958c1b28a34][paring-down-a-kernel-config]]/
    - [[file:eudyptula.org::#062d9a4b-848d-4faf-8456-65d7546d08e9][troubleshooting-cifs]]/
    - [[file:eudyptula.org::#51a7d5ac-e259-4d53-aa3d-27f4893f3a77][resizing-a-vm-image]]/
    - [[file:eudyptula.org::#b32dc6ad-81bf-41fd-8c1d-24a72d6468f1][the-pc-speaker-device]]/
    - [[file:eudyptula.org::#b4a93119-0bd3-4bac-8275-68a40f8a6f69][module-auto-loading]]/
    - [[file:eudyptula.org::#11713263-20ae-4326-a076-dd7fcb4d0b76][source-kernel-uninstall-script]]/
    - [[file:eudyptula.org::#ad4353ca-42df-48b3-98ac-e9ebbf309dab][procfs]]/
    - [[file:eudyptula.org::#61c6e16b-a1bf-49ef-8bd9-4385461387b8][setting-up-a-credential-helper-for-git]]/
    - [[file:eudyptula.org::#5bf573bb-0efb-4e59-b714-df47a537a1ea][mailing-list-archives]]/
- Tinyrenderer/
  - README.txt
    #+begin_src text
      > A small software rasteriser written in C++
    #+end_src
  - [[https://github.com/scottjcrouch/tinyrenderer][src]]/
- ScootNES/
  - README.txt
    #+begin_src text
      > An NTSC NES emulator in C++
    #+end_src
  - [[https://github.com/scottjcrouch/ScootNES][src]]/
* logs/
:PROPERTIES:
:ID:       5c2b30b2-15b6-49dc-acfd-d02dfc17316e
:CUSTOM_ID: logs
:END:
- [[file:logs.org::#0402cbcd-975f-4bea-a7f7-b3ad5dda44fc][poetry]]/
- [[file:logs.org::#a2346381-a557-4d4e-b003-41b5ab7f3b66][self-talk-talk]]/
- [[file:logs.org::#dda22b2d-98e6-493b-999e-b5a8dfe2980b][llm-critique-critique]]/
- [[file:logs.org::#7b4b6f53-22c6-46eb-a3b6-2b8d50ec98ae][grab-bag]]/
- [[file:logs.org::#5b94478a-4878-470e-bdff-6ec996f206d3][the-unintelligibility-of-entropy]]/
- [[file:logs.org::#db0e8424-c200-432e-b437-e5f181f00098][differentiating-differentiation]]/
- [[file:logs.org::#4ae9aa2b-8ea5-4eaf-a9da-21896c7cd90c][semantic-adjacency]]/
- [[file:logs.org::#d93ec70e-fc24-446e-a747-d9fde1bd70b2][wittgenstein-exegesis]]/
- [[file:logs.org::#e6c1d84c-1278-4759-8b8f-9d3383477d5a][poisson-point-processes-at-zero]]/
- [[file:logs.org::#775d8d65-72c1-4785-808c-472d4641d07e][a-metaphor-for-the-acquisition-of-knowledge]]/
- [[file:logs.org::#dd285cf9-f153-4478-8252-3c2ac0305c88][true-but-unprovable]]/
- [[file:logs.org::#dfbf5fb4-3b3d-4326-a95b-7f96b12b4171][lessons-from-versailles]]/
- [[file:logs.org::#001f745e-80e8-47fa-8131-2b494354e345][naming-and-necessity]]/
- [[file:logs.org::#e8ae9869-b754-44a1-af01-3661e52c22e7][to-ward-off-spurious-wakeups]]/
- [[file:logs.org::#1020c982-c193-42d5-b3a5-4435b8d51660][the-portable-nietzsche]]/
- [[file:logs.org::#ce782ae0-4e76-4d3d-abe5-98277e4fc03b][phlegmatic-rumination]]/
- [[file:logs.org::#ebb60e9c-5a7f-4104-8309-a328d5518f35][camus-on-the-death-penalty]]/
- [[file:logs.org::#1136f3fd-78b8-4fd6-b9bc-810345999640][dual-processes]]/
