index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Hello.</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">Hello.</h1>

<div id="outline-container-org9e10ac1" class="outline-2">
<h2 id="projects">projects/</h2>
<div class="outline-text-2" id="text-projects">
<ul class="org-ul">
<li>Eudyptula-Challenge/
<ul class="org-ul">
<li><p>
README.txt
</p>
<div class="org-src-container">
<pre class="src src-text">&gt; A series of challenges relating to Linux kernel development
</pre>
</div></li>
<li><a href="https://github.com/scottjcrouch/eudyptula-challenge">src</a>/</li>
<li><a href="eudyptula.html#7b320482-5d72-4c5c-9ec0-beff19101cc0">introduction</a>/</li>
<li><a href="eudyptula.html#c2b28cc5-a489-41c1-a830-8434bc1a63ac">hello-world-module</a>/</li>
<li><a href="eudyptula.html#80b1401c-ac7d-41a0-af2a-4d29c6183058">creating-a-custom-kernel</a>/</li>
<li><a href="eudyptula.html#89ff7eea-432e-4ee0-a17c-516b11107734">decorating-the-version-string</a>/</li>
<li><a href="eudyptula.html#ac689271-0c7e-4816-b5ce-b81777b0b02d">kernel-coding-style-linting</a>/</li>
<li><a href="eudyptula.html#c5e3bcd6-dd71-4efd-8f51-eb62ba994307">udev-and-module-aliases</a>/</li>
<li><a href="eudyptula.html#1158c320-30bc-48d3-a42c-feea3eeb6e71">the-misc-driver-interface</a>/</li>
<li><a href="eudyptula.html#8401a002-06f1-444a-bed4-9cbe35161e52">linux-next</a>/</li>
<li><a href="eudyptula.html#314f2c84-9822-4972-ba28-2d42d2953299">debugfs</a>/</li>
<li><a href="eudyptula.html#29787ffa-a04c-44ac-a030-7b1452bf710c">sysfs-and-kobjects</a>/</li>
<li><a href="eudyptula.html#4cf49816-7559-408c-bea0-5f39131bba5d">submitting-a-patch</a>/</li>
<li><a href="eudyptula.html#253a35cd-3887-4b5c-a67b-b0dbdbed3cb0">adding-attributes-to-an-existing-kobject</a>/</li>
<li><a href="eudyptula.html#3155bc29-4d2c-4b83-958b-c29008e1beee">intrusive-linked-lists</a>/</li>
<li><a href="eudyptula.html#32fe9de9-7258-47db-9439-b8742c4e842e">the-slab-layer</a>/</li>
<li><a href="eudyptula.html#e6179887-4177-4b70-8dcd-389de0dd6c74">procfs-and-task-structs</a>/</li>
<li><a href="eudyptula.html#7b9b2b15-ca21-4f76-964b-93edc2d98ba0">creating-a-new-syscall</a>/</li>
<li><a href="eudyptula.html#fde2b5a7-5542-42b5-a1f0-1bad9b560563">semantic-checking-and-kbuild-issues</a>/</li>
<li><a href="eudyptula.html#51ac94e1-515d-4e7f-a7ee-7a186091f63d">kthreads-and-wait-queues</a>/</li>
<li><a href="eudyptula.html#258b4714-e7ff-42bb-97e8-bc5b211bf260">kthreads-and-wait-queues-part-two</a>/</li>
<li><a href="eudyptula.html#43f17fcc-501c-419c-b172-ef769dee9d39">netfilter-hooks</a>/</li>
<li><a href="eudyptula.html#7271318d-2789-4669-9d55-e1da2d06f5ac">patching-fatfs</a>/</li>
<li><a href="eudyptula.html#efb0188f-a193-403d-8b47-1bd0f761600f">appendices</a>/
<ul class="org-ul">
<li><a href="eudyptula.html#db5b3b96-8ee6-4f86-8208-6958c1b28a34">paring-down-a-kernel-config</a>/</li>
<li><a href="eudyptula.html#062d9a4b-848d-4faf-8456-65d7546d08e9">troubleshooting-cifs</a>/</li>
<li><a href="eudyptula.html#51a7d5ac-e259-4d53-aa3d-27f4893f3a77">resizing-a-vm-image</a>/</li>
<li><a href="eudyptula.html#b32dc6ad-81bf-41fd-8c1d-24a72d6468f1">the-pc-speaker-device</a>/</li>
<li><a href="eudyptula.html#b4a93119-0bd3-4bac-8275-68a40f8a6f69">module-auto-loading</a>/</li>
<li><a href="eudyptula.html#11713263-20ae-4326-a076-dd7fcb4d0b76">source-kernel-uninstall-script</a>/</li>
<li><a href="eudyptula.html#ad4353ca-42df-48b3-98ac-e9ebbf309dab">procfs</a>/</li>
<li><a href="eudyptula.html#61c6e16b-a1bf-49ef-8bd9-4385461387b8">setting-up-a-credential-helper-for-git</a>/</li>
<li><a href="eudyptula.html#5bf573bb-0efb-4e59-b714-df47a537a1ea">mailing-list-archives</a>/</li>
</ul></li>
</ul></li>
<li>Tinyrenderer/
<ul class="org-ul">
<li><p>
README.txt
</p>
<div class="org-src-container">
<pre class="src src-text">&gt; A small software rasteriser written in C++
</pre>
</div></li>
<li><a href="https://github.com/scottjcrouch/tinyrenderer">src</a>/</li>
</ul></li>
<li>ScootNES/
<ul class="org-ul">
<li><p>
README.txt
</p>
<div class="org-src-container">
<pre class="src src-text">&gt; An NTSC NES emulator in C++
</pre>
</div></li>
<li><a href="https://github.com/scottjcrouch/ScootNES">src</a>/</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org01ed62e" class="outline-2">
<h2 id="logs">logs/</h2>
<div class="outline-text-2" id="text-logs">
<ul class="org-ul">
<li><a href="logs.html#0402cbcd-975f-4bea-a7f7-b3ad5dda44fc">poetry</a>/</li>
<li><a href="logs.html#a2346381-a557-4d4e-b003-41b5ab7f3b66">self-talk-talk</a>/</li>
<li><a href="logs.html#dda22b2d-98e6-493b-999e-b5a8dfe2980b">llm-critique-critique</a>/</li>
<li><a href="logs.html#7b4b6f53-22c6-46eb-a3b6-2b8d50ec98ae">grab-bag</a>/</li>
<li><a href="logs.html#5b94478a-4878-470e-bdff-6ec996f206d3">the-unintelligibility-of-entropy</a>/</li>
<li><a href="logs.html#db0e8424-c200-432e-b437-e5f181f00098">differentiating-differentiation</a>/</li>
<li><a href="logs.html#4ae9aa2b-8ea5-4eaf-a9da-21896c7cd90c">semantic-adjacency</a>/</li>
<li><a href="logs.html#d93ec70e-fc24-446e-a747-d9fde1bd70b2">wittgenstein-exegesis</a>/</li>
<li><a href="logs.html#e6c1d84c-1278-4759-8b8f-9d3383477d5a">poisson-point-processes-at-zero</a>/</li>
<li><a href="logs.html#775d8d65-72c1-4785-808c-472d4641d07e">a-metaphor-for-the-acquisition-of-knowledge</a>/</li>
<li><a href="logs.html#dd285cf9-f153-4478-8252-3c2ac0305c88">true-but-unprovable</a>/</li>
<li><a href="logs.html#dfbf5fb4-3b3d-4326-a95b-7f96b12b4171">lessons-from-versailles</a>/</li>
<li><a href="logs.html#001f745e-80e8-47fa-8131-2b494354e345">naming-and-necessity</a>/</li>
<li><a href="logs.html#e8ae9869-b754-44a1-af01-3661e52c22e7">to-ward-off-spurious-wakeups</a>/</li>
<li><a href="logs.html#1020c982-c193-42d5-b3a5-4435b8d51660">the-portable-nietzsche</a>/</li>
<li><a href="logs.html#ce782ae0-4e76-4d3d-abe5-98277e4fc03b">phlegmatic-rumination</a>/</li>
<li><a href="logs.html#ebb60e9c-5a7f-4104-8309-a328d5518f35">camus-on-the-death-penalty</a>/</li>
<li><a href="logs.html#1136f3fd-78b8-4fd6-b9bc-810345999640">dual-processes</a>/</li>
</ul>
</div>
</div>
