content/index.org
* bookmarks/
:PROPERTIES:
:ID:       fb9a5299-981d-415d-8827-240ae8c7139a
:CUSTOM_ID: bookmarks
:END:
- book-reviews/
  - [[https://gameofrent.com/content/progress-and-poverty-review][/Progress and Poverty/ (Henry George)]]
  - [[https://www.awanderingmind.blog/posts/2022-05-22-book-review-civilization-and-its-discontents.html][/Civilization and Its Discontents/ (Sigmund Freud)]]
  - [[https://etiennefd.substack.com/p/1980s-jane-jacobs-on-cities-states][/Cities and the Wealth of Nations/ and /The Question of Separatism/ (Jane Jacobs)]]
  - [[https://slatestarcodex.com/2017/03/16/book-review-seeing-like-a-state/][/Seeing Like a State/ (James Scott)]]
  - [[https://slatestarcodex.com/2017/09/05/book-review-surfing-uncertainty/][/Surfing Uncertainty/ (Andy Clark)]]
  - [[https://slatestarcodex.com/2016/11/10/book-review-house-of-god/][/House of God/ (Samuel Shem)]]
  - [[https://www.astralcodexten.com/p/your-book-review-secret-government][/Secret Government/ (Brian Kogelmann)]]
  - [[https://www.astralcodexten.com/p/your-book-review-on-the-marble-cliffs][/On the Marble Cliffs/ (Ernst Jünger)]]
  - [[https://www.astralcodexten.com/p/your-book-review-the-rise-and-fall][/The Rise and Fall of the Third Reich/ (William L. Shirer)]]
  - [[https://gwern.net/review/cultural-revolution][/The Cultural Revolution/ (Frank Dikötter)]]
  - [[https://gwern.net/review/mcnamara][/McNamara's Folly/ (Hamilton Gregory)]]
  - [[https://www.theintrinsicperspective.com/p/the-gossip-trap][/The Dawn of Everything/ (David Graeber, David Wengrow)]]
  - [[https://drossbucket.com/2021/08/05/book-review-the-roots-of-romanticism/][/The Roots of Romanticism/ (Isaiah Berlin)]]
  - [[https://thepolyphony.org/2023/09/20/continental-philosophy-of-psychiatry-the-lure-of-madness-book-review/][/Continental Philosophy of Psychiatry: The Lure of Madness/ (Alastair Morgan)]]
  - [[https://rootsofprogress.org/ashton-industrial-revolution-highlights][/The Industrial Revolution, 1760--1830/ (Thomas S. Ashton)]]
  - [[https://thingofthings.substack.com/p/facts-i-learned-from-blood-sweat][/Blood, Sweat, & Chrome: The Wild and True Story of Mad Max: Fury Road/ (Kyle Buchanan)]]
  - [[https://thingofthings.substack.com/p/weird-people-of-history-beatrice][/Unmask Alice: LSD, Satanic Panic, and the Imposter Behind the World's Most Notorious Diaries/ (Rich Emerson)]]
  - [[https://thingofthings.substack.com/p/interesting-facts-from-lying-for][/Lying for Money: How Legendary Frauds Reveal the Workings of Our World/ (Dan Davies)]] ([[https://thingofthings.substack.com/p/what-fraud-teaches-us-about-economics][part 2]])
  - [[https://www.lesswrong.com/posts/x4n4jcoDP7xh5LWLq/book-summary-consciousness-and-the-brain][/Consciousness and the Brain/ (Stanislas Dehaene)]]
  - [[https://www.lesswrong.com/s/g72vrjJSJSZnqBrKx/p/i9xyZBS3qzA8nFXNQ][/Unlocking the Emotional Brain/ (Bruce Ecker, Robin Ticic, Laurel Hulley)]]
  - [[https://unstableontology.com/2022/06/03/a-short-conceptual-explainer-of-immanuel-kants-critique-of-pure-reason/][/Critique of Pure Reason/ (Immanuel Kant)]]
  - [[https://josephnoelwalker.com/146-richard-rhodes/][/The Making of the Atomic Bomb/ (Richard Rhodes) [I know, technically not a book review but a great listen nonetheless]​]]
  - [[https://www.thepsmiths.com/p/review-the-education-of-cyrus-by][/The Education of Cyrus/ (Xenophon)]]
  - [[https://bookmarks.reviews/george-orwells-1940-review-of-mein-kampf/][/Mein Kampf/ (Guy that killed Hitler)]]
  - [[https://www.youtube.com/watch?v=bqloPw5wp48][/Twilight/ (Stephenie Meyer) [yt]​]]
- philosophy/
  - [[https://asteriskmag.com/issues/01/making-sense-of-moral-change][Making Sense of Moral Change]]
  - [[https://www.youtube.com/watch?v=rbaD66oTvuo][Hinge Epistemology [yt]​]]
  - [[https://wittgenfine337.substack.com/p/compressing-hegel][Compressing Hegel]]
  - [[https://dynomight.net/final-boss/][Final Boss]]
  - [[https://aeon.co/essays/was-plato-a-mythmaker-or-the-mythbuster-of-western-thought][Was Plato a Mythmaker or the Mythbuster of Western Thought? (Why Philosophy Needs Myth)]]
  - [[https://aeon.co/essays/karl-jaspers-the-forgotten-father-of-existentialism][Karl Jaspers: The Forgotten Father of Existentialism]]
  - [[https://www.youtube.com/watch?v=YxBShJU_CKs][The Map of Philosophy [yt]​]]
  - [[https://philosophybear.substack.com/p/fifty-four-ideas-from-a-philosophical][Fifty-four Ideas from a Philosophical Bear]]
  - [[https://aeon.co/ideas/is-there-any-real-distinction-between-high-and-low-pleasures][Is there any real distinction between "high" and "low" pleasures?]]
  - [[https://www.strangeloopcanon.com/p/beware-the-idle-kantian][Beware the Idle Kantian]]
  - [[https://ravenmagazine.org/magazine/the-great-masquerade-of-evil/][The Great Masquerade of Evil]]
  - [[https://parrhesia.substack.com/p/contra-alexander-on-moral-offsetting][Contra Alexander on Moral Offsetting]]
  - [[https://www.erichgrunewald.com/posts/moral-standing-is-not-moral-agency/][Moral Standing is not Moral Agency]]
  - [[https://www.erichgrunewald.com/posts/networks-of-meaning/][Networks of meaning]]
  - [[https://slatestarcodex.com/2014/11/21/the-categories-were-made-for-man-not-man-for-the-categories/][The Categories Were Made For Man, Not Man For The Categories]]
  - [[https://theconversation.com/is-it-time-to-reconsider-the-idea-of-the-banality-of-evil-216737][Is it time to reconsider the idea of "the banality of evil"?]]
  - [[https://foldedpapers.substack.com/p/agnostic-virtue-ethics][Agnostic virtue ethics]]
  - [[https://iai.tv/articles/back-to-the-future-hegelian-pragmatism-auid-2719][Back to the Future: Hegelian Pragmatism]]
  - [[https://aeon.co/essays/is-it-possible-to-hold-truly-contradictory-beliefs-together][What is incoherence?]]
  - [[https://psyche.co/ideas/ancient-greek-antilogic-is-the-craft-of-suspending-judgment][Ancient Greek antilogic is the craft of suspending judgment]]
  - [[https://commonreader.wustl.edu/c/variations-on-the-theme-of-silence/][Variations on the Theme of Silence]]
- psychology/
  - [[https://psyche.co/ideas/as-a-psychiatrist-ive-seen-how-chasing-happiness-leads-to-misery][As a psychiatrist, I've seen how chasing happiness leads to misery]]
  - [[https://www.lesswrong.com/posts/K2JBqDeETX2yEgyyZ/the-limits-of-introspection][The limits of introspection]]
  - [[https://slatestarcodex.com/2015/07/16/cbt-in-the-water-supply/][CBT In The Water Supply]]
  - [[https://philosophybear.substack.com/p/the-origins-of-religion-and-ocd][The Origins of Religion and OCD]]
  - [[https://www.psychologytoday.com/us/blog/out-the-ooze/201707/what-is-the-right-size-group-conversation][What is the Right Size for a Group Conversation?]]
  - [[https://psyche.co/ideas/essentialism-is-insidious-but-it-can-also-be-helpful][Essentialism is insidious --- but it can also be helpful]]
  - [[https://www.astralcodexten.com/p/the-psychopolitics-of-trauma][The Psychopolitics of Trauma]]
  - [[https://dynomight.net/taste-games/][Taste games]]
  - [[https://sarahconstantin.substack.com/p/what-does-the-cerebellum-do-anyway][What does the Cerebellum Do Anyway?]]
  - [[https://superbowl.substack.com/p/two-paths-out-of-hell][Two Paths out of Hell]]
  - [[https://psyche.co/ideas/how-feelings-about-thinking-help-us-navigate-our-world][How ‘feelings about thinking’ help us navigate our world]]
  - [[https://psyche.co/ideas/you-can-want-things-you-dont-like-and-like-things-you-dont-want][You can want things you don’t like and like things you don’t want]]
- audio-visual/
  - [[https://www.youtube.com/watch?v=mFUkaGEMhD8][The Anatomy of: Animal Collective - What Would I Want? Sky [yt]​]]
  - [[https://www.youtube.com/watch?v=yUpr1F1dZt0][Naomi Sato demonstrates the shō [yt; It's just a beautiful instrument]​]]
  - [[https://newmotion.bandcamp.com/album/one-second-a-compilation-album][One Second: A Compilation Album]] ([[https://www.youtube.com/watch?v=eafjCuNahIo][yt version, since this album /really/ needs gapless playback]])
  - [[https://www.youtube.com/watch?v=I4wiVc0NBlo][The Slow Rise Of The PSS 280 [yt]​]]
  - [[https://www.youtube.com/watch?v=i5SpdgWwPiw][Morgan Ågren TRUM TV shows [yt; If you like drumming and/or fusion]​]]
  - [[https://www.youtube.com/watch?v=pnISpahN2dM][Hiromi [Uehara]: Tiny Desk Concert [yt; If you like piano and/or fusion]​]]
  - [[https://www.youtube.com/watch?v=V1adLb9c6U4][Danny Elfman & Trent Reznor - True [yt]​]]
  - [[https://www.youtube.com/watch?v=w5azY0dH67U][Oneohtrix Point Never - Long Road Home [yt]​]]
  - [[https://www.youtube.com/watch?v=CKZpMp7SrZI][Klô Pelgag - Notre-Dame-des-Sept-Douleurs [yt]​]]
  - [[https://www.youtube.com/watch?v=76DFmInhucA][Autechre - Rettic AC (unofficial MV) [yt]​]]
  - [[https://vimeo.com/839085383][TAKRAR | تكرار [vimeo]​]]
  - [[https://vimeo.com/589324922][Serial Parallels [vimeo]​]]
  - [[https://www.youtube.com/watch?v=DGSqglrPadw]["Grands Canons" - Alain Biet [yt]​]]
  - [[https://www.youtube.com/watch?v=wRWmep4pSzg][Premonitions Following an Evil Deed by David Lynch [One of his lesser known short (!) films]​]]
  - [[https://www.youtube.com/watch?v=Cj6ho1-G6tw][Way Back Home w/ Danny MacAskill [yt]​]]
  - [[https://www.youtube.com/watch?v=9sUsiYnHwqI][Ascota 170 mechanical computer calculates square root [yt]​]]
  - [[https://www.youtube.com/watch?v=lTwg4mFF32E][15 Note Poly Tempo Pendulum [yt]​]]
  - painting/
    - [[https://www.youtube.com/watch?v=MgrO5za0lSY][Francis Bacon: A Brush with Violence (2017) [yt]​]]
    - [[https://www.youtube.com/watch?v=yUq9qMm9NtI][The Raft of the Medusa by Théodore Géricault [yt]​]]
    - [[https://www.youtube.com/watch?v=T15Kv6dtYO0][The Arnolfini Portrait by Jan Van Eyck [yt]​]]
    - [[https://www.youtube.com/watch?v=FkPmiUFZyu8][When The World Became A De Chirico Painting [yt]​]]
  - photography/
    - [[https://www.youtube.com/watch?v=6Guy90qPKCU][Photographer Spotlight: Edward Burtynsky [yt]​]]
    - [[https://www.youtube.com/watch?v=HdOLiRCXjmA][Photographer Spotlight: Michael Wolf [yt]​]]
    - [[https://www.youtube.com/watch?v=aWCT3blDzu0][Monhegan Island to the Schoodic Peninsula in Maine [yt]​]]
    - [[https://www.youtube.com/watch?v=97GwbI27w10][Christopher Doyle: Filming in the Neon World [yt]​]]
  - poetry/
    - [[https://www.youtube.com/watch?v=Y5kcGYcDE0o]["Birches" by Robert Frost [yt]​]]
    - [[https://reactormag.com/sonnet-against-entropy/]["Sonnet: Against Entropy" by John M. Ford]]
    - [[https://www.poetryfoundation.org/poems/49849/between-walls]["Between Walls" by William Carlos Williams]]
    - [[https://gladdestthing.com/poems/the-orange]["The Orange" by Wendy Cope]]
  - essays-on-art/
    - [[https://meltingasphalt.com/a-natural-history-of-beauty/][A Natural History of Beauty]]
    - [[https://www.erichgrunewald.com/posts/how-can-one-tell-what-is-beautiful/][How Can One Tell What Is Beautiful?]]
    - [[https://www.classicalfuturist.com/p/guided-by-the-beauty-of-ones-philosophies][Guided by the Beauty of One's Philosophies]]
    - [[https://www.reddit.com/r/explainlikeimfive/comments/bkqw1i/eli5_why_is_andy_warhols_campbell_soup_can/][u/BillHicksScream comments on Warhol, Rothko, and art history]]
    - [[https://etiennefd.substack.com/p/the-figurative-to-abstract-art-pipeline][The Figurative-to-Abstract Art Pipeline]]
    - [[https://orbistertius.substack.com/p/the-metaphysics-of-novels-and-magic][The Metaphysics of Novels and Magic]]
    - [[https://orbistertius.substack.com/p/borges-and-the-essay][Borges and the Essay]]
    - [[https://www.glass-bead.org/article/a-theory-of-vibe/][A Theory of Vibe]]
    - [[https://necsus-ejms.org/the-elephant-mans-sound-tracked/][The Elephant Man's Sound, Tracked]]
    - [[https://obscuritory.com/essay/incredible-boxes-of-hock-wah-yeo/][The incredible boxes of Hock Wah Yeo]]
    - [[https://www.youtube.com/watch?v=ffllV6-aqWU][David Lynch: The Treachery of Language [yt]​]]
  - essays-on-architecture/
    - [[https://www.currentaffairs.org/2017/10/why-you-hate-contemporary-architecture][Why You Hate Contemporary Architecture]]
    - [[https://www.currentaffairs.org/2021/04/when-is-the-revolution-in-architecture-coming][When Is the Revolution in Architecture Coming?]]
    - [[https://worksinprogress.co/issue/in-praise-of-pastiche][In Praise of Pastiche]]
    - [[https://worksinprogress.co/issue/making-architecture-easy][Making Architecture Easy]]
    - [[https://misfitsarchitecture.com/2015/07/12/building-bridges/][Building Bridges]]
    - [[https://www.bldgblog.com/2010/01/nakatomi-space/][Nakatomi Space]]
    - [[https://aeon.co/essays/the-architectural-style-wars-have-started-all-over-again][The New Architecture Wars]]
    - [[https://mcmansionhell.com/post/741171396971053056/weve-found-it-folks-mcmansion-heaven][McMansion Heaven]]
    - [[https://etiennefd.substack.com/p/how-expensive-is-architectural-ornamentation][How Expensive Is Architectural Ornamentation?]]
- game-theory/
  - [[https://www.youtube.com/watch?v=tJjCbdOWXgM][Common Knowledge and Hats]]
  - [[https://www.youtube.com/watch?v=rStL7niR7gs][The Rules for Rulers]]
  - [[https://www.lesswrong.com/s/ZNNi2uNx9E6iwGKKG][Introduction to Game Theory]]
  - [[https://slatestarcodex.com/2014/07/30/meditations-on-moloch/][Meditations on Moloch]]
  - [[https://acoup.blog/2022/03/11/collections-nuclear-deterrence-101/][Nuclear Deterrence 101]]
  - [[https://www.lesswrong.com/posts/X5RyaEDHNq5qutSHK/anti-social-punishment][Anti-social Punishment]]
- stem/
  - [[https://idlewords.com/2010/03/scott_and_scurvy.htm][Scott and Scurvy]]
  - [[https://www.experimental-history.com/p/how-to-keep-cakes-moist-and-cause][How to Keep Cakes Moist and Cause the Greatest Tragedies of the 20th Century]]
  - [[https://www.experimental-history.com/p/science-is-a-strong-link-problem][Science is a Strong-Link Problem]]
  - [[https://www.experimental-history.com/p/on-the-importance-of-staring-directly][On the Importance of Staring Directly into the Sun]]
  - [[https://worksinprogress.co/issue/the-elements-of-scientific-style][The Elements of Scientific Style]]
  - [[https://andersource.dev/2022/04/19/dk-autocorrelation.html][I can't let go of "The Dunning--Kruger Effect is Autocorrelation" [To this day I'm still unsure whether DK is a genuine /effect/, or merely incidental]​]]
  - [[https://etiennefd.substack.com/p/the-difference-between-science-and][The Difference Between Science and the Humanities Is Reading the Classics]]
  - [[https://aeon.co/essays/why-is-simplicity-so-unreasonably-effective-at-scientific-explanation][Why Simplicity Works]]
  - [[http://johnsalvatier.org/blog/2017/reality-has-a-surprising-amount-of-detail][Reality has a surprising amount of detail]]
  - [[https://rootsofprogress.org/why-did-we-wait-so-long-for-the-threshing-machine][Why did we wait so long for the threshing machine?]]
  - [[https://ciechanow.ski/mechanical-watch/][Mechanical Watches [how they work]​]]
  - [[https://ciechanow.ski/cameras-and-lenses/][Cameras and Lenses [how they work]​]]
  - [[https://ciechanow.ski/gps/][GPS [how it works]​]]
  - [[https://ciechanow.ski/internal-combustion-engine/][Internal Combustion Engines [how they work]​]]
  - [[https://thebaffler.com/salvos/enter-the-supersensorium-hoel][Enter The Supersensorium [on the purpose of dreams]​]]
  - [[https://ourworldindata.org/limits-personal-experience][The Limits of our Personal Experience and the Value of Statistics]]
  - math/
    - [[https://www.youtube.com/playlist?list=PLqHnHG5X2PXBVZsf_rvAwGnUgZ-mGdqCy][Math Mornings at Yale [yt]​]]
    - [[https://www.youtube.com/watch?v=1QAqxiO8VHM][Is this one connected curve, or two? [yt]​]]
    - [[https://www.youtube.com/watch?v=nK2jYk37Rlg][The Mathematical Problem with Music, and How to Solve It [yt]​]]
    - [[https://www.youtube.com/watch?v=a-767WnbaCQ][Percolation: a Mathematical Phase Transition [yt]​]]
    - [[https://www.youtube.com/watch?v=DovunOxlY1k][AT&T Archives: Similiarities of Wave Behavior [yt]​]]
    - [[https://www.youtube.com/watch?v=yYAw79386WI][Around The Corner - How Differential Steering Works [yt]​]]
    - [[https://www.youtube.com/watch?v=bRCNenhcvpw][IBM Selectric Typewriter & its Digital-to-Analogue Converter [yt]​]]
    - [[https://www.youtube.com/watch?v=B1J6Ou4q8vE][Animation vs. Math [yt]​]]
    - [[https://azeemba.com/posts/pi-in-other-universes.html][Pi in Other Universes]]
    - [[https://mathenchant.wordpress.com/2017/12/17/the-roots-of-unity/][The Roots of Unity]]
    - [[https://mathenchant.wordpress.com/2019/12/23/the-null-salad/][The Null Salad]]
    - [[https://mathenchant.wordpress.com/2023/02/17/things-names-and-numbers/][Things, Names, and Numbers]]
    - [[https://bartoszmilewski.com/2013/07/29/quantum-homotopy-computer/][Quantum homotopy computer]]
    - [[https://www.youtube.com/watch?v=mH0oCDa74tE][Group theory, abstraction, and the 196,883-dimensional monster [yt]​]]
    - [[https://www.youtube.com/watch?v=0CHZMY02Dhk][What does it mean to take a complex derivative? (visually explained) [yt]​]]
    - [[https://www.youtube.com/watch?v=rK3xcRYLWeg][P vs. NP | Complexity Theory Explained Visually [yt]​]]
    - [[https://www.youtube.com/watch?v=PjKlMXhxtTM][Making a Pitch Shifter [yt]​]]
  - tech/
    - [[https://www.youtube.com/watch?v=y7KWGv_t-MU][Programming Language Ideas That Work And Don't Work [yt]​]]
    - [[https://roughlywritten.substack.com/p/random-thoughts-15-years-into-software][Random Thoughts 15 years into Software Engineering]]
    - [[https://nothinghuman.substack.com/p/the-tyranny-of-the-marginal-user][The Tyranny of the Marginal User]]
    - [[https://anthonyhobday.com/sideprojects/saferules/][Visual Design Rules you can Safely Follow Every Time]]
    - [[https://www.youtube.com/watch?v=XrlrbfGZo2k][37C3 - Breaking "DRM" in Polish trains [yt]​]]
    - linux/
      - [[https://makelinux.github.io/kernel/map/][A Map of the Linux kernel]]
      - [[https://www.youtube.com/watch?v=Sk9TatW9ino][Building the Simplest Possible Linux System [yt]​]]
      - [[https://www.youtube.com/watch?v=o_AIw9bGogo][The Tragedy of systemd [yt]​]]
      - [[https://www.youtube.com/watch?v=Ws6zR3rFXa4][Being Systematic with systemd [yt]​]]
      - [[https://www.youtube.com/watch?v=VpwXj93_yZk][Reducing the Boot Time of Linux Devices [yt]​]]
      - [[https://www.youtube.com/watch?v=NNol7fRGo2E][A Tour of the ARM Architecture and its Linux Support [yt]​]]
      - [[https://magcius.github.io/xplain/article/index.html][A good /X-planation/ of X]]
      - [[https://maizure.org/projects/decoded-gnu-coreutils/][Decoded: GNU coreutils]]
      - [[https://ownyourbits.com/2018/05/23/the-real-power-of-linux-executables/][The Real Power of Linux Executables]] ([[https://web.archive.org/web/*/https://ownyourbits.com/2018/05/23/the-real-power-of-linux-executables/][archived link here]])
      - [[https://blog.liw.fi/posts/2023/debian-reasons/][Why is Debian the way it is?]]
      - [[https://lwn.net/Articles/928581/][The Early Days of Linux]]
      - [[https://lwn.net/Articles/939842/][Making life (even) harder for proprietary modules]]
      - [[https://lwn.net/Articles/944686/][Revisiting the kernel's preemption models]] ([[https://lwn.net/Articles/945422/][part 2]])
      - [[https://utcc.utoronto.ca/~cks/space/blog/linux/KernelModesettingBackground][How we wound up with Linux's kernel mode setting (KMS)]]
      - [[https://lwn.net/Articles/962788/][A look at Nix and Guix]]
    - git-gud/
      - [[https://johnmathews.is/blog/rys-git-tutorial][Ry's Git Tutorial]]
      - [[https://jvns.ca/blog/2023/11/01/confusing-git-terminology/][Confusing git terminology]]
      - [[https://ohshitgit.com/][Oh Shit, Git!?!]]
      - [[https://felipec.wordpress.com/2021/07/05/git-update/][git update: The Odyssey for a Sensible git pull]]
      - [[https://jvns.ca/blog/2023/11/06/rebasing-what-can-go-wrong-/][git rebase: What can Go Wrong?]]
      - [[https://blogs.oracle.com/linux/post/backporting-patches-using-git][Backporting Patches Using Git]]
    - unicode-is-hard/
      - [[https://manishearth.github.io/blog/2017/01/14/stop-ascribing-meaning-to-unicode-code-points/][Let's Stop Ascribing Meaning to Code Points]]
      - [[https://tonsky.me/blog/unicode/][The Absolute Minimum Every Software Developer Must Know About Unicode in 2023]]
      - [[https://github.com/codebox/homoglyph/blob/master/raw_data/chars.txt][A list of homoglyphs [sets of unicode characters that look annoyingly identical]​]]
    - llms/
      - [[https://blog.domenic.me/chatgpt-simulacrum/][ChatGPT Is Not a Blurry JPEG of the Web.  It's a Simulacrum.]]
      - [[https://dynomight.net/llms/][Historical analogies for LLMs]]
      - [[https://www.reddit.com/r/slatestarcodex/comments/16x2q57/alignment_is_malleable/][Alignment is Malleable]]
      - [[https://norvig.com/chomsky.html][On Chomsky and the Two Cultures of Statistical Learning]]
      - [[https://www.lesswrong.com/posts/D7PumeYTDPfBTp3i7/the-waluigi-effect-mega-post][The Waluigi Effect]]
      - [[https://studio.ribbonfarm.com/p/text-is-all-you-need][Text is all you need]]
      - [[https://sohl-dickstein.github.io/2022/11/06/strong-Goodhart.html][Too much efficiency makes everything worse: overfitting and the strong version of Goodhart's law]]
      - [[https://robhorning.substack.com/p/so-called-well-meaning][So-called well-meaning]]
      - [[https://robhorning.substack.com/p/implosion-sites][Implosion sites]]
      - [[https://www.youtube.com/watch?v=wjZofJX0v4M][But what is a GPT? Visual intro to Transformers [yt]​]] ([[https://www.youtube.com/watch?v=eMlx5fFNoYc][part 2]])
- history/
  - [[https://www.exurbe.com/black-death-covid-and-why-we-keep-telling-the-myth-of-a-renaissance-golden-age-and-bad-middle-ages/][Black Death, COVID, and Why We Keep Telling the Myth of a Renaissance Golden Age and Bad Middle Ages]]
  - [[https://www.exurbe.com/on-progress-and-historical-change/][On Progress and Historical Change]]
  - [[https://www.theatlantic.com/magazine/archive/2013/08/the-real-meaning-of-ich-bin-ein-berliner/309500/][The Real Meaning of "Ich Bin ein Berliner"]]
  - [[https://old.reddit.com/r/WarCollege/comments/137gxpv/at_the_time_of_the_british_empires_reduction_in/jiu1q8i/][u/2Regin comments on the British Empire's reduction in role from a superpower to a regional power]]
  - [[https://www.noemamag.com/the-modern-wisdom-of-daoist-history/][The Modern Wisdom Of Daoist History]]
  - [[https://jacobin.com/2023/08/eugene-debs-bicycles-socialism][Eugene Debs Really Loved Bicycles]]
  - [[https://glineq.blogspot.com/2023/10/there-is-no-exit-for-dictators.html][There is No Exit for Dictators]]
  - [[https://asteriskmag.com/issues/05/democracy-by-mistake][Democracy by Mistake]]
  - [[https://etiennefd.substack.com/p/the-most-nuanced-take-you-will-ever][The Most Nuanced Take You Will Ever Read About Sparta (and North Korea)]]
- politics-and-the-english-language/
  - [[https://everythingstudies.com/2019/10/30/cat-couplings/][Cat Couplings]]
  - [[https://everythingstudies.com/2018/02/12/wordy-weapons-of-is-ought-alloy/][Wordy Weapons of Is--Ought Alloy]]
  - [[https://www.lesswrong.com/s/pC6DYFLPMTCbEwH8W/p/i42Dfoh4HtsCAfXxL][Babble]]
  - [[https://www.reddit.com/r/slatestarcodex/comments/m57i1c/prose_is_bad/][Prose is Bad]]
  - [[https://unstableontology.com/2022/05/02/on-the-paradox-of-tolerance-in-relation-to-fascism-and-online-content-moderation/][On the paradox of tolerance in relation to fascism and online content moderation [An intractable problem?]​]]
  - [[https://www.lesswrong.com/posts/7cAsBPGh98pGyrhz9/decoupling-vs-contextualising-norms][Decoupling vs Contextualising Norms]] (and a good [[https://unconfusion.substack.com/p/decoupling-decoupling-from-rationality][follow-up]])
  - [[https://slatestarcodex.com/2018/01/24/conflict-vs-mistake/][Conflict vs. Mistake]]
  - [[https://slatestarcodex.com/2014/09/30/i-can-tolerate-anything-except-the-outgroup/][I Can Tolerate Anything Except The Outgroup]]
  - [[https://slatestarcodex.com/2016/04/04/the-ideology-is-not-the-movement/][The Ideology Is Not The Movement]]
  - [[https://foldedpapers.substack.com/p/my-years-as-a-feminist-on-red-pill][My years as a feminist on red-pill-adjacent rationalist reddit]]
  - [[https://dynomight.net/espionage/][Everything is espionage: Things I learned researching Assange]]
- human-interest/
  - [[https://kentnerburn.com/the-cab-ride-ill-never-forget/][The Cab Ride I'll Never Forget]]
  - [[https://www.theatlantic.com/magazine/archive/2004/05/a-sea-story/302940/][A Sea Story (2004)]]
  - [[https://www.newyorker.com/magazine/2021/09/06/magazine20000417hells-kitchen][Hell's Kitchen (Anthony Bourdain; 2000)]]
  - [[https://longreads.com/2023/01/03/the-strangely-beautiful-experience-of-google-reviews/][The Strangely Beautiful Experience of Google Reviews]]
  - [[https://www.guernicamag.com/the-protagonist-is-never-in-control/][The Protagonist is Never in Control]]
  - [[https://mattlakeman.org/2020/01/22/the-new-epidemic-my-experience-of-losing-a-friend-to-heroin/][The New Epidemic --- My Experience of Losing a Friend to Heroin]]
  - [[https://lithub.com/growing-up-as-an-untouchable/][Growing Up as an Untouchable]]
  - [[https://www.lrb.co.uk/the-paper/v45/n21/gale-walden/diary][David's Presence (Gale Walden; 2023)]]
  - [[https://www.thisamericanlife.org/809/the-call][The Call]]
- fiction/
  - [[https://qntm.org/mmacevedo][Lena]]
  - [[https://scp-wiki.wikidot.com/scp-3008][SCP-3008]]
  - [[https://sadoeuphemist.tumblr.com/post/615521935528460288/a-scorpion-not-knowing-how-to-swim-asked-a-frog][A scorpion, not knowing how to swim, asked a frog to carry it across the river]]
  - [[https://slatestarcodex.com/2015/06/02/and-i-show-you-how-deep-the-rabbit-hole-goes/][And I show you how deep the rabbit hole goes]]
  - [[https://slatestarcodex.com/2017/11/09/ars-longa-vita-brevis/][Ars Longa, Vita Brevis]]
  - [[https://slatestarcodex.com/2015/08/17/the-goddess-of-everything-else-2/][The Goddess of Everything Else]]
  - [[https://brandnewbox.com/inthestacks/][In The Stacks (Maisie's Tune)]]
  - [[https://www.newyorker.com/magazine/1991/10/21/carried-away][Carried Away (Alice Munro)]]
- fun/
  - [[https://ncase.me/door/][Door [It's cute]​]]
  - [[https://www.youtube.com/watch?v=IJwYUMAEwRU][Election [I like to roll this one out whenever election-season arrives]​]]
  - [[https://www.ribbonfarm.com/2021/05/27/space-luck/][Space Luck]]
  - [[https://www.smbc-comics.com/comic/veiled][At the annual colloquium of Evil Philosophers [hahaha]​]]
- misc/
  - [[https://www.marginalia.nu/log/19-website-discoverability-crisis/][The Small Website Discoverability Crisis [the (partial) inspiration for this list]​]]
  - [[https://www.raptitude.com/2022/01/everything-must-be-paid-for-twice/][Everything Must be Paid For Twice]]
  - [[https://www.samstack.io/p/beware-interesting-ideas][Beware Interesting Ideas]]
  - [[https://progressforum.org/posts/dmS6QLHv8FZRcsnaP/the-curse-of-plenty][The Curse of Plenty]]
  - [[https://www.bitsaboutmoney.com/archive/the-waste-stream-of-consumer-finance/][Credit Card Debt Collection]]
  - [[https://www.youtube.com/watch?v=8hdGq9g1YFQ][Hofeld's Theory of Rights vs. Privileges [yt]​]]
  - [[https://radimentary.wordpress.com/2020/12/16/two-explorations/][Two Explorations [explore vs. exploit]​]]
  - [[https://srconstantin.wordpress.com/2016/10/20/ra/][Ra]]
  - [[https://www.reddit.com/r/japan/comments/7x4zoh/are_there_really_no_good_japanese_shows/du5wc6a/][u/dokool comments on Japanese TV shows (2018)]]
  - [[https://www.reddit.com/r/explainlikeimfive/comments/16cm85y/eli5_how_does_the_irs_know_if_i_dont_report_half/jzk8gyb/][u/Miliean on how tax audits work]]
  - [[https://arcove.substack.com/p/iron-lotus][Iron Lotus]]
  - [[https://www.saturdayeveningpost.com/2013/03/how-doctors-die/][How Doctors Die]]
  - [[https://www.awanderingmind.blog/posts/2022-07-30-state-of-south-africa.html][The state of South Africa, 28ish years post-apartheid]]
  - [[https://alok.github.io/2022/11/09/dissection/][What It's Like to Dissect a Cadaver]]
  - [[https://www.lesswrong.com/posts/eRohP4gbxuBuhqTbe/attempted-telekinesis][Attempted Telekinesis]]
  - [[https://www.lesswrong.com/s/FoaLfnrZGGGMdcAoF/p/9fB4gvoooNYa4t56S][Power Buys You Distance From The Crime]]
  - [[https://www.lesswrong.com/posts/dC7mP5nSwvpL65Qu5/why-the-tails-come-apart][Why the tails come apart]]
  - [[https://www.lesswrong.com/s/FoaLfnrZGGGMdcAoF/p/G5TwJ9BGxcgh5DsmQ][Yes Requires the Possibility of No]]
  - [[https://thezvi.wordpress.com/2017/09/30/slack/][Slack]]
  - [[https://thezvi.wordpress.com/2020/05/03/on-negative-feedback-and-simulacra/][On Negative Feedback and Simulacra]]
  - [[https://www.lesswrong.com/s/cv2aZaRR22MPC5QwE/p/qDmnyEMtJkE9Wrpau][Simulacra Levels and their Interactions]]
  - [[https://jenn.site/2022/08/rich-friend-poor-friend/][Rich Friend, Poor Friend]]
  - [[https://collabfund.com/blog/a-few-laws-of-getting-rich/][A Few Laws of Getting Rich]]
  - [[https://robhorning.substack.com/p/spacing-the-cans][Spacing the cans]]
