index.html
<div id="outline-container-org8a7b1db" class="outline-2">
<h2 id="bookmarks">bookmarks/</h2>
<div class="outline-text-2" id="text-bookmarks">
<ul class="org-ul">
<li>book-reviews/
<ul class="org-ul">
<li><a href="https://gameofrent.com/content/progress-and-poverty-review"><i>Progress and Poverty</i> (Henry George)</a></li>
<li><a href="https://www.awanderingmind.blog/posts/2022-05-22-book-review-civilization-and-its-discontents.html"><i>Civilization and Its Discontents</i> (Sigmund Freud)</a></li>
<li><a href="https://etiennefd.substack.com/p/1980s-jane-jacobs-on-cities-states"><i>Cities and the Wealth of Nations</i> and <i>The Question of Separatism</i> (Jane Jacobs)</a></li>
<li><a href="https://slatestarcodex.com/2017/03/16/book-review-seeing-like-a-state/"><i>Seeing Like a State</i> (James Scott)</a></li>
<li><a href="https://slatestarcodex.com/2017/09/05/book-review-surfing-uncertainty/"><i>Surfing Uncertainty</i> (Andy Clark)</a></li>
<li><a href="https://slatestarcodex.com/2016/11/10/book-review-house-of-god/"><i>House of God</i> (Samuel Shem)</a></li>
<li><a href="https://www.astralcodexten.com/p/your-book-review-secret-government"><i>Secret Government</i> (Brian Kogelmann)</a></li>
<li><a href="https://www.astralcodexten.com/p/your-book-review-on-the-marble-cliffs"><i>On the Marble Cliffs</i> (Ernst Jünger)</a></li>
<li><a href="https://www.astralcodexten.com/p/your-book-review-the-rise-and-fall"><i>The Rise and Fall of the Third Reich</i> (William L. Shirer)</a></li>
<li><a href="https://gwern.net/review/cultural-revolution"><i>The Cultural Revolution</i> (Frank Dikötter)</a></li>
<li><a href="https://gwern.net/review/mcnamara"><i>McNamara&rsquo;s Folly</i> (Hamilton Gregory)</a></li>
<li><a href="https://www.theintrinsicperspective.com/p/the-gossip-trap"><i>The Dawn of Everything</i> (David Graeber, David Wengrow)</a></li>
<li><a href="https://drossbucket.com/2021/08/05/book-review-the-roots-of-romanticism/"><i>The Roots of Romanticism</i> (Isaiah Berlin)</a></li>
<li><a href="https://thepolyphony.org/2023/09/20/continental-philosophy-of-psychiatry-the-lure-of-madness-book-review/"><i>Continental Philosophy of Psychiatry: The Lure of Madness</i> (Alastair Morgan)</a></li>
<li><a href="https://rootsofprogress.org/ashton-industrial-revolution-highlights"><i>The Industrial Revolution, 1760&#x2013;1830</i> (Thomas S. Ashton)</a></li>
<li><a href="https://thingofthings.substack.com/p/facts-i-learned-from-blood-sweat"><i>Blood, Sweat, &amp; Chrome: The Wild and True Story of Mad Max: Fury Road</i> (Kyle Buchanan)</a></li>
<li><a href="https://thingofthings.substack.com/p/weird-people-of-history-beatrice"><i>Unmask Alice: LSD, Satanic Panic, and the Imposter Behind the World&rsquo;s Most Notorious Diaries</i> (Rich Emerson)</a></li>
<li><a href="https://thingofthings.substack.com/p/interesting-facts-from-lying-for"><i>Lying for Money: How Legendary Frauds Reveal the Workings of Our World</i> (Dan Davies)</a> (and <a href="https://thingofthings.substack.com/p/what-fraud-teaches-us-about-economics">part 2</a>)</li>
<li><a href="https://www.lesswrong.com/posts/x4n4jcoDP7xh5LWLq/book-summary-consciousness-and-the-brain"><i>Consciousness and the Brain</i> (Stanislas Dehaene)</a></li>
<li><a href="https://www.lesswrong.com/s/g72vrjJSJSZnqBrKx/p/i9xyZBS3qzA8nFXNQ"><i>Unlocking the Emotional Brain</i> (Bruce Ecker, Robin Ticic, Laurel Hulley)</a></li>
<li><a href="https://unstableontology.com/2022/06/03/a-short-conceptual-explainer-of-immanuel-kants-critique-of-pure-reason/"><i>Critique of Pure Reason</i> (Immanuel Kant)</a></li>
<li><a href="https://josephnoelwalker.com/146-richard-rhodes/"><i>The Making of the Atomic Bomb</i> (Richard Rhodes) [I know, technically not a book review but a great listen nonetheless]​</a></li>
<li><a href="https://www.thepsmiths.com/p/review-the-education-of-cyrus-by"><i>The Education of Cyrus</i> (Xenophon)</a></li>
<li><a href="https://bookmarks.reviews/george-orwells-1940-review-of-mein-kampf/"><i>Mein Kampf</i> (Guy that killed Hitler)</a></li>
<li><a href="https://www.youtube.com/watch?v=bqloPw5wp48"><i>Twilight</i> (Stephenie Meyer) [yt]​</a></li>
<li><a href="https://insidestory.org.au/the-power-of-shame/"><i>Shame: The Politics and Power of an Emotion</i> (David Keen)</a></li>
<li><a href="https://www.astralcodexten.com/p/your-book-review-autobiography-of"><i>The Autobiography of Yukichi Fukuzawa</i> (Yukichi Fukuzawa)</a></li>
</ul></li>
<li>philosophy/
<ul class="org-ul">
<li><a href="https://asteriskmag.com/issues/01/making-sense-of-moral-change">Making Sense of Moral Change</a></li>
<li><a href="https://www.youtube.com/watch?v=rbaD66oTvuo">Hinge Epistemology [yt]​</a></li>
<li><a href="https://wittgenfine337.substack.com/p/compressing-hegel">Compressing Hegel</a></li>
<li><a href="https://dynomight.net/final-boss/">Final Boss</a></li>
<li><a href="https://aeon.co/essays/was-plato-a-mythmaker-or-the-mythbuster-of-western-thought">Was Plato a Mythmaker or the Mythbuster of Western Thought? (Why Philosophy Needs Myth)</a></li>
<li><a href="https://aeon.co/essays/karl-jaspers-the-forgotten-father-of-existentialism">Karl Jaspers: The Forgotten Father of Existentialism</a></li>
<li><a href="https://www.youtube.com/watch?v=YxBShJU_CKs">The Map of Philosophy [yt]​</a></li>
<li><a href="https://philosophybear.substack.com/p/fifty-four-ideas-from-a-philosophical">Fifty-four Ideas from a Philosophical Bear</a></li>
<li><a href="https://aeon.co/ideas/is-there-any-real-distinction-between-high-and-low-pleasures">Is there any real distinction between &ldquo;high&rdquo; and &ldquo;low&rdquo; pleasures?</a></li>
<li><a href="https://www.strangeloopcanon.com/p/beware-the-idle-kantian">Beware the Idle Kantian</a></li>
<li><a href="https://ravenmagazine.org/magazine/the-great-masquerade-of-evil/">The Great Masquerade of Evil</a></li>
<li><a href="https://parrhesia.substack.com/p/contra-alexander-on-moral-offsetting">Contra Alexander on Moral Offsetting</a></li>
<li><a href="https://www.erichgrunewald.com/posts/moral-standing-is-not-moral-agency/">Moral Standing is not Moral Agency</a></li>
<li><a href="https://www.erichgrunewald.com/posts/networks-of-meaning/">Networks of meaning</a></li>
<li><a href="https://theconversation.com/is-it-time-to-reconsider-the-idea-of-the-banality-of-evil-216737">Is it time to reconsider the idea of &ldquo;the banality of evil&rdquo;?</a></li>
<li><a href="https://foldedpapers.substack.com/p/agnostic-virtue-ethics">Agnostic virtue ethics</a></li>
<li><a href="https://iai.tv/articles/back-to-the-future-hegelian-pragmatism-auid-2719">Back to the Future: Hegelian Pragmatism</a></li>
<li><a href="https://aeon.co/essays/is-it-possible-to-hold-truly-contradictory-beliefs-together">What is incoherence?</a></li>
<li><a href="https://psyche.co/ideas/ancient-greek-antilogic-is-the-craft-of-suspending-judgment">Ancient Greek antilogic is the craft of suspending judgment</a></li>
<li><a href="https://commonreader.wustl.edu/c/variations-on-the-theme-of-silence/">Variations on the Theme of Silence</a></li>
<li><a href="https://empyreantrail.wordpress.com/2016/12/19/logic-of-being/">Logic of Being and Naught: A False Start</a></li>
<li><a href="https://www.youtube.com/watch?v=uPXTTbmjh50">The Death Drive [yt]​</a></li>
<li><a href="https://www.youtube.com/watch?v=aI9PVkR-ioI">Explained: I Would Prefer Not To [yt]​</a></li>
<li><a href="https://robhorning.substack.com/p/ordinary-unhappiness">Ordinary unhappiness</a></li>
</ul></li>
<li>psychology/
<ul class="org-ul">
<li><a href="https://psyche.co/ideas/as-a-psychiatrist-ive-seen-how-chasing-happiness-leads-to-misery">As a psychiatrist, I&rsquo;ve seen how chasing happiness leads to misery</a></li>
<li><a href="https://www.lesswrong.com/posts/K2JBqDeETX2yEgyyZ/the-limits-of-introspection">The limits of introspection</a></li>
<li><a href="https://slatestarcodex.com/2015/07/16/cbt-in-the-water-supply/">CBT In The Water Supply</a></li>
<li><a href="https://philosophybear.substack.com/p/the-origins-of-religion-and-ocd">The Origins of Religion and OCD</a></li>
<li><a href="https://www.psychologytoday.com/us/blog/out-the-ooze/201707/what-is-the-right-size-group-conversation">What is the Right Size for a Group Conversation?</a></li>
<li><a href="https://psyche.co/ideas/essentialism-is-insidious-but-it-can-also-be-helpful">Essentialism is insidious &#x2014; but it can also be helpful</a></li>
<li><a href="https://www.astralcodexten.com/p/the-psychopolitics-of-trauma">The Psychopolitics of Trauma</a></li>
<li><a href="https://dynomight.net/taste-games/">Taste games</a></li>
<li><a href="https://sarahconstantin.substack.com/p/what-does-the-cerebellum-do-anyway">What does the Cerebellum Do Anyway?</a></li>
<li><a href="https://superbowl.substack.com/p/two-paths-out-of-hell">Two Paths out of Hell</a></li>
<li><a href="https://psyche.co/ideas/how-feelings-about-thinking-help-us-navigate-our-world">How ‘feelings about thinking’ help us navigate our world</a></li>
<li><a href="https://psyche.co/ideas/you-can-want-things-you-dont-like-and-like-things-you-dont-want">You can want things you don’t like and like things you don’t want</a></li>
<li><a href="https://kajsotala.fi/2024/07/indecision-and-internalized-authority-figures/">Indecision and internalized authority figures</a></li>
</ul></li>
<li>audio-visual/
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=mFUkaGEMhD8">The Anatomy of: Animal Collective - What Would I Want? Sky [yt]​</a></li>
<li><a href="https://www.youtube.com/watch?v=yUpr1F1dZt0">Naomi Sato demonstrates the shō [yt; It&rsquo;s just a beautiful instrument]​</a></li>
<li><a href="https://newmotion.bandcamp.com/album/one-second-a-compilation-album">One Second: A Compilation Album</a> (<a href="https://www.youtube.com/watch?v=eafjCuNahIo">yt version, since this album <i>really</i> needs gapless playback</a>)</li>
<li><a href="https://www.youtube.com/watch?v=I4wiVc0NBlo">The Slow Rise Of The PSS 280 [yt]​</a></li>
<li><a href="https://www.youtube.com/watch?v=i5SpdgWwPiw">Morgan Ågren TRUM TV shows [yt; If you like drumming and/or fusion]​</a></li>
<li><a href="https://www.youtube.com/watch?v=pnISpahN2dM">Hiromi [Uehara]: Tiny Desk Concert [yt; If you like piano and/or fusion]​</a></li>
<li><a href="https://www.youtube.com/watch?v=V1adLb9c6U4">Danny Elfman &amp; Trent Reznor - True [yt]​</a></li>
<li><a href="https://www.youtube.com/watch?v=w5azY0dH67U">Oneohtrix Point Never - Long Road Home [yt]​</a></li>
<li><a href="https://www.youtube.com/watch?v=CKZpMp7SrZI">Klô Pelgag - Notre-Dame-des-Sept-Douleurs [yt]​</a></li>
<li><a href="https://www.youtube.com/watch?v=76DFmInhucA">Autechre - Rettic AC (unofficial MV) [yt]​</a></li>
<li><a href="https://vimeo.com/839085383">TAKRAR | تكرار [vimeo]​</a></li>
<li><a href="https://vimeo.com/589324922">Serial Parallels [vimeo]​</a></li>
<li><a href="https://www.youtube.com/watch?v=DGSqglrPadw">&ldquo;Grands Canons&rdquo; - Alain Biet [yt]​</a></li>
<li><a href="https://www.youtube.com/watch?v=wRWmep4pSzg">Premonitions Following an Evil Deed by David Lynch [One of his lesser known short (!) films]​</a></li>
<li><a href="https://www.youtube.com/watch?v=Cj6ho1-G6tw">Way Back Home w/ Danny MacAskill [yt]​</a></li>
<li><a href="https://www.youtube.com/watch?v=9sUsiYnHwqI">Ascota 170 mechanical computer calculates square root [yt]​</a></li>
<li><a href="https://www.youtube.com/watch?v=lTwg4mFF32E">15 Note Poly Tempo Pendulum [yt]​</a></li>
<li><a href="https://www.youtube.com/playlist?list=PLfPjbwTbN4GPcg3ePanfk2qkeOn1qUHs1">Ichiko Aoba with 12 Ensemble at Milton Court [yt]​</a></li>
<li>painting/
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=MgrO5za0lSY">Francis Bacon: A Brush with Violence (2017) [yt]​</a></li>
<li><a href="https://www.youtube.com/watch?v=yUq9qMm9NtI">The Raft of the Medusa by Théodore Géricault [yt]​</a></li>
<li><a href="https://www.youtube.com/watch?v=T15Kv6dtYO0">The Arnolfini Portrait by Jan Van Eyck [yt]​</a></li>
<li><a href="https://www.youtube.com/watch?v=FkPmiUFZyu8">When The World Became A De Chirico Painting [yt]​</a></li>
</ul></li>
<li>photography/
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=6Guy90qPKCU">Photographer Spotlight: Edward Burtynsky [yt]​</a></li>
<li><a href="https://www.youtube.com/watch?v=HdOLiRCXjmA">Photographer Spotlight: Michael Wolf [yt]​</a></li>
<li><a href="https://www.youtube.com/watch?v=aWCT3blDzu0">Monhegan Island to the Schoodic Peninsula in Maine [yt]​</a></li>
<li><a href="https://www.youtube.com/watch?v=97GwbI27w10">Christopher Doyle: Filming in the Neon World [yt]​</a></li>
</ul></li>
<li>poetry/
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=Y5kcGYcDE0o">&ldquo;Birches&rdquo; by Robert Frost [yt]​</a></li>
<li><a href="https://reactormag.com/sonnet-against-entropy/">&ldquo;Sonnet: Against Entropy&rdquo; by John M. Ford</a></li>
<li><a href="https://www.poetryfoundation.org/poems/49849/between-walls">&ldquo;Between Walls&rdquo; by William Carlos Williams</a></li>
<li><a href="https://gladdestthing.com/poems/the-orange">&ldquo;The Orange&rdquo; by Wendy Cope</a></li>
</ul></li>
<li>essays-on-art/
<ul class="org-ul">
<li><a href="https://meltingasphalt.com/a-natural-history-of-beauty/">A Natural History of Beauty</a></li>
<li><a href="https://www.erichgrunewald.com/posts/how-can-one-tell-what-is-beautiful/">How Can One Tell What Is Beautiful?</a></li>
<li><a href="https://www.classicalfuturist.com/p/guided-by-the-beauty-of-ones-philosophies">Guided by the Beauty of One&rsquo;s Philosophies</a></li>
<li><a href="https://www.reddit.com/r/explainlikeimfive/comments/bkqw1i/eli5_why_is_andy_warhols_campbell_soup_can/">u/BillHicksScream comments on Warhol, Rothko, and art history</a></li>
<li><a href="https://etiennefd.substack.com/p/the-figurative-to-abstract-art-pipeline">The Figurative-to-Abstract Art Pipeline</a></li>
<li><a href="https://orbistertius.substack.com/p/the-metaphysics-of-novels-and-magic">The Metaphysics of Novels and Magic</a></li>
<li><a href="https://orbistertius.substack.com/p/borges-and-the-essay">Borges and the Essay</a></li>
<li><a href="https://www.glass-bead.org/article/a-theory-of-vibe/">A Theory of Vibe</a></li>
<li><a href="https://necsus-ejms.org/the-elephant-mans-sound-tracked/">The Elephant Man&rsquo;s Sound, Tracked</a></li>
<li><a href="https://obscuritory.com/essay/incredible-boxes-of-hock-wah-yeo/">The incredible boxes of Hock Wah Yeo</a></li>
<li><a href="https://www.youtube.com/watch?v=ffllV6-aqWU">David Lynch: The Treachery of Language [yt]​</a></li>
</ul></li>
<li>essays-on-architecture/
<ul class="org-ul">
<li><a href="https://www.currentaffairs.org/2017/10/why-you-hate-contemporary-architecture">Why You Hate Contemporary Architecture</a></li>
<li><a href="https://www.currentaffairs.org/2021/04/when-is-the-revolution-in-architecture-coming">When Is the Revolution in Architecture Coming?</a></li>
<li><a href="https://worksinprogress.co/issue/in-praise-of-pastiche">In Praise of Pastiche</a></li>
<li><a href="https://worksinprogress.co/issue/making-architecture-easy">Making Architecture Easy</a></li>
<li><a href="https://misfitsarchitecture.com/2015/07/12/building-bridges/">Building Bridges</a></li>
<li><a href="https://www.bldgblog.com/2010/01/nakatomi-space/">Nakatomi Space</a></li>
<li><a href="https://aeon.co/essays/the-architectural-style-wars-have-started-all-over-again">The New Architecture Wars</a></li>
<li><a href="https://mcmansionhell.com/post/741171396971053056/weve-found-it-folks-mcmansion-heaven">McMansion Heaven</a></li>
<li><a href="https://etiennefd.substack.com/p/how-expensive-is-architectural-ornamentation">How Expensive Is Architectural Ornamentation?</a></li>
</ul></li>
</ul></li>
<li>game-theory/
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=tJjCbdOWXgM">Common Knowledge and Hats</a></li>
<li><a href="https://www.youtube.com/watch?v=rStL7niR7gs">The Rules for Rulers</a></li>
<li><a href="https://www.lesswrong.com/s/ZNNi2uNx9E6iwGKKG">Introduction to Game Theory</a></li>
<li><a href="https://slatestarcodex.com/2014/07/30/meditations-on-moloch/">Meditations on Moloch</a></li>
<li><a href="https://acoup.blog/2022/03/11/collections-nuclear-deterrence-101/">Nuclear Deterrence 101</a></li>
<li><a href="https://www.lesswrong.com/posts/X5RyaEDHNq5qutSHK/anti-social-punishment">Anti-social Punishment</a></li>
</ul></li>
<li>stem/
<ul class="org-ul">
<li><a href="https://idlewords.com/2010/03/scott_and_scurvy.htm">Scott and Scurvy</a></li>
<li><a href="https://www.experimental-history.com/p/how-to-keep-cakes-moist-and-cause">How to Keep Cakes Moist and Cause the Greatest Tragedies of the 20th Century</a></li>
<li><a href="https://www.experimental-history.com/p/science-is-a-strong-link-problem">Science is a Strong-Link Problem</a></li>
<li><a href="https://www.experimental-history.com/p/on-the-importance-of-staring-directly">On the Importance of Staring Directly into the Sun</a></li>
<li><a href="https://worksinprogress.co/issue/the-elements-of-scientific-style">The Elements of Scientific Style</a></li>
<li><a href="https://andersource.dev/2022/04/19/dk-autocorrelation.html">I can&rsquo;t let go of &ldquo;The Dunning&#x2013;Kruger Effect is Autocorrelation&rdquo; [To this day I&rsquo;m still unsure whether DK is a genuine <i>effect</i>, or merely incidental]​</a></li>
<li><a href="https://etiennefd.substack.com/p/the-difference-between-science-and">The Difference Between Science and the Humanities Is Reading the Classics</a></li>
<li><a href="https://aeon.co/essays/why-is-simplicity-so-unreasonably-effective-at-scientific-explanation">Why Simplicity Works</a></li>
<li><a href="http://johnsalvatier.org/blog/2017/reality-has-a-surprising-amount-of-detail">Reality has a surprising amount of detail</a></li>
<li><a href="https://rootsofprogress.org/why-did-we-wait-so-long-for-the-threshing-machine">Why did we wait so long for the threshing machine?</a></li>
<li><a href="https://ciechanow.ski/mechanical-watch/">Mechanical Watches [how they work]​</a></li>
<li><a href="https://ciechanow.ski/cameras-and-lenses/">Cameras and Lenses [how they work]​</a></li>
<li><a href="https://ciechanow.ski/gps/">GPS [how it works]​</a></li>
<li><a href="https://ciechanow.ski/internal-combustion-engine/">Internal Combustion Engines [how they work]​</a></li>
<li><a href="https://thebaffler.com/salvos/enter-the-supersensorium-hoel">Enter The Supersensorium [on the purpose of dreams]​</a></li>
<li><a href="https://ourworldindata.org/limits-personal-experience">The Limits of our Personal Experience and the Value of Statistics</a></li>
<li>math/
<ul class="org-ul">
<li><a href="https://www.youtube.com/playlist?list=PLqHnHG5X2PXBVZsf_rvAwGnUgZ-mGdqCy">Math Mornings at Yale [yt]​</a></li>
<li><a href="https://www.youtube.com/watch?v=1QAqxiO8VHM">Is this one connected curve, or two? [yt]​</a></li>
<li><a href="https://www.youtube.com/watch?v=nK2jYk37Rlg">The Mathematical Problem with Music, and How to Solve It [yt]​</a></li>
<li><a href="https://www.youtube.com/watch?v=a-767WnbaCQ">Percolation: a Mathematical Phase Transition [yt]​</a></li>
<li><a href="https://www.youtube.com/watch?v=DovunOxlY1k">AT&amp;T Archives: Similiarities of Wave Behavior [yt]​</a></li>
<li><a href="https://www.youtube.com/watch?v=yYAw79386WI">Around The Corner - How Differential Steering Works [yt]​</a></li>
<li><a href="https://www.youtube.com/watch?v=bRCNenhcvpw">IBM Selectric Typewriter &amp; its Digital-to-Analogue Converter [yt]​</a></li>
<li><a href="https://www.youtube.com/watch?v=B1J6Ou4q8vE">Animation vs. Math [yt]​</a></li>
<li><a href="https://azeemba.com/posts/pi-in-other-universes.html">Pi in Other Universes</a></li>
<li><a href="https://mathenchant.wordpress.com/2017/12/17/the-roots-of-unity/">The Roots of Unity</a></li>
<li><a href="https://mathenchant.wordpress.com/2019/12/23/the-null-salad/">The Null Salad</a></li>
<li><a href="https://mathenchant.wordpress.com/2023/02/17/things-names-and-numbers/">Things, Names, and Numbers</a></li>
<li><a href="https://bartoszmilewski.com/2013/07/29/quantum-homotopy-computer/">Quantum homotopy computer</a></li>
<li><a href="https://www.youtube.com/watch?v=mH0oCDa74tE">Group theory, abstraction, and the 196,883-dimensional monster [yt]​</a></li>
<li><a href="https://www.youtube.com/watch?v=0CHZMY02Dhk">What does it mean to take a complex derivative? (visually explained) [yt]​</a></li>
<li><a href="https://www.youtube.com/watch?v=rK3xcRYLWeg">P vs. NP | Complexity Theory Explained Visually [yt]​</a></li>
<li><a href="https://www.youtube.com/watch?v=PjKlMXhxtTM">Making a Pitch Shifter [yt]​</a></li>
<li><a href="https://photonlines.substack.com/p/an-intuitive-guide-to-maxwells-equations">An Intuitive Guide to Maxwell&rsquo;s Equations</a></li>
</ul></li>
<li>tech/
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=y7KWGv_t-MU">Programming Language Ideas That Work And Don&rsquo;t Work [yt]​</a></li>
<li><a href="https://roughlywritten.substack.com/p/random-thoughts-15-years-into-software">Random Thoughts 15 years into Software Engineering</a></li>
<li><a href="https://nothinghuman.substack.com/p/the-tyranny-of-the-marginal-user">The Tyranny of the Marginal User</a></li>
<li><a href="https://anthonyhobday.com/sideprojects/saferules/">Visual Design Rules you can Safely Follow Every Time</a></li>
<li><a href="https://www.youtube.com/watch?v=XrlrbfGZo2k">37C3 - Breaking &ldquo;DRM&rdquo; in Polish trains [yt]​</a></li>
<li>linux/
<ul class="org-ul">
<li><a href="https://www.linusakesson.net/programming/tty/">The TTY demystified</a></li>
<li><a href="https://makelinux.github.io/kernel/map/">A Map of the Linux kernel</a></li>
<li><a href="https://www.youtube.com/watch?v=Sk9TatW9ino">Building the Simplest Possible Linux System [yt]​</a></li>
<li><a href="https://www.youtube.com/watch?v=o_AIw9bGogo">The Tragedy of systemd [yt]​</a></li>
<li><a href="https://www.youtube.com/watch?v=Ws6zR3rFXa4">Being Systematic with systemd [yt]​</a></li>
<li><a href="https://www.youtube.com/watch?v=VpwXj93_yZk">Reducing the Boot Time of Linux Devices [yt]​</a></li>
<li><a href="https://www.youtube.com/watch?v=NNol7fRGo2E">A Tour of the ARM Architecture and its Linux Support [yt]​</a></li>
<li><a href="https://magcius.github.io/xplain/article/index.html">A good <i>X-planation</i> of X</a></li>
<li><a href="https://maizure.org/projects/decoded-gnu-coreutils/">Decoded: GNU coreutils</a></li>
<li><a href="https://ownyourbits.com/2018/05/23/the-real-power-of-linux-executables/">The Real Power of Linux Executables</a> (<a href="https://web.archive.org/web/*/https://ownyourbits.com/2018/05/23/the-real-power-of-linux-executables/">archived link here</a>)</li>
<li><a href="https://blog.liw.fi/posts/2023/debian-reasons/">Why is Debian the way it is?</a></li>
<li><a href="https://lwn.net/Articles/928581/">The Early Days of Linux</a></li>
<li><a href="https://lwn.net/Articles/939842/">Making life (even) harder for proprietary modules</a></li>
<li><a href="https://lwn.net/Articles/944686/">Revisiting the kernel&rsquo;s preemption models</a> (<a href="https://lwn.net/Articles/945422/">part 2</a>)</li>
<li><a href="https://utcc.utoronto.ca/~cks/space/blog/linux/KernelModesettingBackground">How we wound up with Linux&rsquo;s kernel mode setting (KMS)</a></li>
<li><a href="https://lwn.net/Articles/962788/">A look at Nix and Guix</a></li>
</ul></li>
<li>git-gud/
<ul class="org-ul">
<li><a href="https://johnmathews.is/blog/rys-git-tutorial">Ry&rsquo;s Git Tutorial</a></li>
<li><a href="https://jvns.ca/blog/2023/11/01/confusing-git-terminology/">Confusing git terminology</a></li>
<li><a href="https://ohshitgit.com/">Oh Shit, Git!?!</a></li>
<li><a href="https://felipec.wordpress.com/2021/07/05/git-update/">git update: The Odyssey for a Sensible git pull</a></li>
<li><a href="https://jvns.ca/blog/2023/11/06/rebasing-what-can-go-wrong-/">git rebase: What can Go Wrong?</a></li>
<li><a href="https://blogs.oracle.com/linux/post/backporting-patches-using-git">Backporting Patches Using Git</a></li>
</ul></li>
<li>unicode-is-hard/
<ul class="org-ul">
<li><a href="https://manishearth.github.io/blog/2017/01/14/stop-ascribing-meaning-to-unicode-code-points/">Let&rsquo;s Stop Ascribing Meaning to Code Points</a></li>
<li><a href="https://tonsky.me/blog/unicode/">The Absolute Minimum Every Software Developer Must Know About Unicode in 2023</a></li>
<li><a href="https://github.com/codebox/homoglyph/blob/master/raw_data/chars.txt">A list of homoglyphs [sets of unicode characters that look annoyingly identical]​</a></li>
</ul></li>
<li>llms/
<ul class="org-ul">
<li><a href="https://blog.domenic.me/chatgpt-simulacrum/">ChatGPT Is Not a Blurry JPEG of the Web.  It&rsquo;s a Simulacrum.</a></li>
<li><a href="https://dynomight.net/llms/">Historical analogies for LLMs</a></li>
<li><a href="https://www.reddit.com/r/slatestarcodex/comments/16x2q57/alignment_is_malleable/">Alignment is Malleable</a></li>
<li><a href="https://norvig.com/chomsky.html">On Chomsky and the Two Cultures of Statistical Learning</a></li>
<li><a href="https://www.lesswrong.com/posts/D7PumeYTDPfBTp3i7/the-waluigi-effect-mega-post">The Waluigi Effect</a></li>
<li><a href="https://studio.ribbonfarm.com/p/text-is-all-you-need">Text is all you need</a></li>
<li><a href="https://sohl-dickstein.github.io/2022/11/06/strong-Goodhart.html">Too much efficiency makes everything worse: overfitting and the strong version of Goodhart&rsquo;s law</a></li>
<li><a href="https://robhorning.substack.com/p/so-called-well-meaning">So-called well-meaning</a></li>
<li><a href="https://robhorning.substack.com/p/implosion-sites">Implosion sites</a></li>
<li><a href="https://www.youtube.com/watch?v=wjZofJX0v4M">But what is a GPT? Visual intro to Transformers [yt]​</a> (<a href="https://www.youtube.com/watch?v=eMlx5fFNoYc">part 2</a>)</li>
</ul></li>
</ul></li>
</ul></li>
<li>history/
<ul class="org-ul">
<li><a href="https://www.exurbe.com/black-death-covid-and-why-we-keep-telling-the-myth-of-a-renaissance-golden-age-and-bad-middle-ages/">Black Death, COVID, and Why We Keep Telling the Myth of a Renaissance Golden Age and Bad Middle Ages</a></li>
<li><a href="https://www.exurbe.com/on-progress-and-historical-change/">On Progress and Historical Change</a></li>
<li><a href="https://www.theatlantic.com/magazine/archive/2013/08/the-real-meaning-of-ich-bin-ein-berliner/309500/">The Real Meaning of &ldquo;Ich Bin ein Berliner&rdquo;</a></li>
<li><a href="https://old.reddit.com/r/WarCollege/comments/137gxpv/at_the_time_of_the_british_empires_reduction_in/jiu1q8i/">u/2Regin comments on the British Empire&rsquo;s reduction in role from a superpower to a regional power</a></li>
<li><a href="https://www.noemamag.com/the-modern-wisdom-of-daoist-history/">The Modern Wisdom Of Daoist History</a></li>
<li><a href="https://jacobin.com/2023/08/eugene-debs-bicycles-socialism">Eugene Debs Really Loved Bicycles</a></li>
<li><a href="https://glineq.blogspot.com/2023/10/there-is-no-exit-for-dictators.html">There is No Exit for Dictators</a></li>
<li><a href="https://asteriskmag.com/issues/05/democracy-by-mistake">Democracy by Mistake</a></li>
<li><a href="https://etiennefd.substack.com/p/the-most-nuanced-take-you-will-ever">The Most Nuanced Take You Will Ever Read About Sparta (and North Korea)</a></li>
</ul></li>
<li>politics-and-the-english-language/
<ul class="org-ul">
<li><a href="https://everythingstudies.com/2019/10/30/cat-couplings/">Cat Couplings</a></li>
<li><a href="https://everythingstudies.com/2018/02/12/wordy-weapons-of-is-ought-alloy/">Wordy Weapons of Is&#x2013;Ought Alloy</a></li>
<li><a href="https://slatestarcodex.com/2014/11/21/the-categories-were-made-for-man-not-man-for-the-categories/">The Categories Were Made For Man, Not Man For The Categories</a></li>
<li><a href="https://unstableontology.com/2022/05/02/on-the-paradox-of-tolerance-in-relation-to-fascism-and-online-content-moderation/">On the paradox of tolerance in relation to fascism and online content moderation [An intractable problem?]​</a></li>
<li><a href="https://www.lesswrong.com/posts/7cAsBPGh98pGyrhz9/decoupling-vs-contextualising-norms">Decoupling vs Contextualising Norms</a> (and a good <a href="https://unconfusion.substack.com/p/decoupling-decoupling-from-rationality">follow-up</a>)</li>
<li><a href="https://slatestarcodex.com/2018/01/24/conflict-vs-mistake/">Conflict vs. Mistake</a></li>
<li><a href="https://slatestarcodex.com/2014/09/30/i-can-tolerate-anything-except-the-outgroup/">I Can Tolerate Anything Except The Outgroup</a></li>
<li><a href="https://slatestarcodex.com/2016/04/04/the-ideology-is-not-the-movement/">The Ideology Is Not The Movement</a></li>
<li><a href="https://foldedpapers.substack.com/p/my-years-as-a-feminist-on-red-pill">My years as a feminist on red-pill-adjacent rationalist reddit</a></li>
<li><a href="https://dynomight.net/espionage/">Everything is espionage: Things I learned researching Assange</a></li>
<li><a href="https://www.awanderingmind.blog/posts/2022-07-30-state-of-south-africa.html">The state of South Africa, 28ish years post-apartheid</a></li>
</ul></li>
<li>syntax-and-structure/
<ul class="org-ul">
<li><a href="https://www.lesswrong.com/s/pC6DYFLPMTCbEwH8W/p/i42Dfoh4HtsCAfXxL">Babble</a></li>
<li><a href="https://www.reddit.com/r/slatestarcodex/comments/m57i1c/prose_is_bad/">Prose is Bad</a></li>
<li><a href="https://aethermug.com/posts/the-beautiful-dissociation-of-the-japanese-language">The Beautiful Dissociation of the Japanese Language</a></li>
<li><a href="https://zompist.com/yingzi/yingzi.htm">Yingzi</a></li>
</ul></li>
<li>human-interest/
<ul class="org-ul">
<li><a href="https://kentnerburn.com/the-cab-ride-ill-never-forget/">The Cab Ride I&rsquo;ll Never Forget</a></li>
<li><a href="https://www.theatlantic.com/magazine/archive/2004/05/a-sea-story/302940/">A Sea Story (2004)</a></li>
<li><a href="https://www.newyorker.com/magazine/2021/09/06/magazine20000417hells-kitchen">Hell&rsquo;s Kitchen (Anthony Bourdain; 2000)</a></li>
<li><a href="https://longreads.com/2023/01/03/the-strangely-beautiful-experience-of-google-reviews/">The Strangely Beautiful Experience of Google Reviews</a></li>
<li><a href="https://www.guernicamag.com/the-protagonist-is-never-in-control/">The Protagonist is Never in Control</a></li>
<li><a href="https://mattlakeman.org/2020/01/22/the-new-epidemic-my-experience-of-losing-a-friend-to-heroin/">The New Epidemic &#x2014; My Experience of Losing a Friend to Heroin</a></li>
<li><a href="https://lithub.com/growing-up-as-an-untouchable/">Growing Up as an Untouchable</a></li>
<li><a href="https://www.lrb.co.uk/the-paper/v45/n21/gale-walden/diary">David&rsquo;s Presence (Gale Walden; 2023)</a></li>
<li><a href="https://www.thisamericanlife.org/809/the-call">The Call</a></li>
</ul></li>
<li>fiction/
<ul class="org-ul">
<li><a href="https://qntm.org/mmacevedo">Lena</a></li>
<li><a href="https://scp-wiki.wikidot.com/scp-3008">SCP-3008</a></li>
<li><a href="https://sadoeuphemist.tumblr.com/post/615521935528460288/a-scorpion-not-knowing-how-to-swim-asked-a-frog">A scorpion, not knowing how to swim, asked a frog to carry it across the river</a></li>
<li><a href="https://slatestarcodex.com/2015/06/02/and-i-show-you-how-deep-the-rabbit-hole-goes/">And I show you how deep the rabbit hole goes</a></li>
<li><a href="https://slatestarcodex.com/2017/11/09/ars-longa-vita-brevis/">Ars Longa, Vita Brevis</a></li>
<li><a href="https://slatestarcodex.com/2015/08/17/the-goddess-of-everything-else-2/">The Goddess of Everything Else</a></li>
<li><a href="https://brandnewbox.com/inthestacks/">In The Stacks (Maisie&rsquo;s Tune)</a></li>
<li><a href="https://www.newyorker.com/magazine/1991/10/21/carried-away">Carried Away (Alice Munro)</a></li>
<li><a href="https://www.newyorker.com/magazine/2003/08/11/runaway-4">Runaway (Alice Munro)</a></li>
</ul></li>
<li>fun/
<ul class="org-ul">
<li><a href="https://ncase.me/door/">Door [It&rsquo;s cute]​</a></li>
<li><a href="https://www.youtube.com/watch?v=IJwYUMAEwRU">Election [I like to roll this one out whenever election-season arrives]​</a></li>
<li><a href="https://www.ribbonfarm.com/2021/05/27/space-luck/">Space Luck</a></li>
<li><a href="https://www.smbc-comics.com/comic/veiled">At the annual colloquium of Evil Philosophers [hahaha]​</a></li>
</ul></li>
<li>misc/
<ul class="org-ul">
<li><a href="https://www.marginalia.nu/log/19-website-discoverability-crisis/">The Small Website Discoverability Crisis [the (partial) inspiration for this list]​</a></li>
<li><a href="https://www.raptitude.com/2022/01/everything-must-be-paid-for-twice/">Everything Must be Paid For Twice</a></li>
<li><a href="https://www.samstack.io/p/beware-interesting-ideas">Beware Interesting Ideas</a></li>
<li><a href="https://progressforum.org/posts/dmS6QLHv8FZRcsnaP/the-curse-of-plenty">The Curse of Plenty</a></li>
<li><a href="https://www.bitsaboutmoney.com/archive/the-waste-stream-of-consumer-finance/">Credit Card Debt Collection</a></li>
<li><a href="https://www.youtube.com/watch?v=8hdGq9g1YFQ">Hofeld&rsquo;s Theory of Rights vs. Privileges [yt]​</a></li>
<li><a href="https://radimentary.wordpress.com/2020/12/16/two-explorations/">Two Explorations [explore vs. exploit]​</a></li>
<li><a href="https://srconstantin.wordpress.com/2016/10/20/ra/">Ra</a></li>
<li><a href="https://www.reddit.com/r/japan/comments/7x4zoh/are_there_really_no_good_japanese_shows/du5wc6a/">u/dokool comments on Japanese TV shows (2018)</a></li>
<li><a href="https://www.reddit.com/r/explainlikeimfive/comments/16cm85y/eli5_how_does_the_irs_know_if_i_dont_report_half/jzk8gyb/">u/Miliean on how tax audits work</a></li>
<li><a href="https://arcove.substack.com/p/iron-lotus">Iron Lotus</a></li>
<li><a href="https://www.saturdayeveningpost.com/2013/03/how-doctors-die/">How Doctors Die</a></li>
<li><a href="https://alok.github.io/2022/11/09/dissection/">What It&rsquo;s Like to Dissect a Cadaver</a></li>
<li><a href="https://www.lesswrong.com/posts/eRohP4gbxuBuhqTbe/attempted-telekinesis">Attempted Telekinesis</a></li>
<li><a href="https://www.lesswrong.com/s/FoaLfnrZGGGMdcAoF/p/9fB4gvoooNYa4t56S">Power Buys You Distance From The Crime</a></li>
<li><a href="https://www.lesswrong.com/posts/dC7mP5nSwvpL65Qu5/why-the-tails-come-apart">Why the tails come apart</a></li>
<li><a href="https://www.lesswrong.com/s/FoaLfnrZGGGMdcAoF/p/G5TwJ9BGxcgh5DsmQ">Yes Requires the Possibility of No</a></li>
<li><a href="https://thezvi.wordpress.com/2017/09/30/slack/">Slack</a></li>
<li><a href="https://thezvi.wordpress.com/2020/05/03/on-negative-feedback-and-simulacra/">On Negative Feedback and Simulacra</a></li>
<li><a href="https://www.lesswrong.com/s/cv2aZaRR22MPC5QwE/p/qDmnyEMtJkE9Wrpau">Simulacra Levels and their Interactions</a></li>
<li><a href="https://jenn.site/2022/08/rich-friend-poor-friend/">Rich Friend, Poor Friend</a></li>
<li><a href="https://collabfund.com/blog/a-few-laws-of-getting-rich/">A Few Laws of Getting Rich</a></li>
<li><a href="https://robhorning.substack.com/p/spacing-the-cans">Spacing the cans</a></li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="https://orgmode.org">Org</a> mode 9.3)</p>
</div>
</body>
</html>
